In [3]:
#CALL ON DEPENDENCIES THAT YOU NEED
import pandas as pd

In [21]:
# USE PD.READ_CSV TO LOAD DATA FROM A CSV FILE
# .HEAD() GIVE YOU THE FIRST 5 RESULTS OF YOUR NEW DATAFRAME
titantic_df = pd.read_csv('Titantic_Data/titanic.csv')
titantic_df.head()

,PassengerID,Name,PClass,Age,Sex,Survived,SexCode
0,1,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,2,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,3,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,4,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,5,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [26]:
#CALCULATE HOW MANY PASSENGERS (WOMEN AND MEN) SURVIVED AND HOW MANY DID NOT. INSTEAD OF PASSENGERID YOU CAN ALSO USE NAME.
titantic_df.groupby(['Sex', 'Survived'])["PassengerID"].count()

Sex     Survived
female  0           154
        1           308
male    0           709
        1           142
Name: Name, dtype: int64

In [25]:
#ANALYZING THE SAME DATA BUT THIS TIME BY CABIN CLASS
titantic_df.groupby(['PClass', 'Survived'])["PassengerID"].count()

PClass  Survived
*       0             1
1st     0           129
        1           193
2nd     0           160
        1           119
3rd     0           573
        1           138
Name: PassengerID, dtype: int64

In [34]:
#VIA PIVOT TABLE CALCULATE HOW MANY WOMEN WERE IN A PARTICULAR CABIN CLASS. I ATTACHED A VARIABLE TO PVT_FEMALE.LOC
pvt_female = titantic_df.pivot_table(index=["Sex"], columns=["PClass"], values='Name', aggfunc='count')
female_cabin_count = pvt_female.loc['female', ['1st', '2nd', '3rd']]
female_cabin_count

PClass
1st    143.0
2nd    107.0
3rd    212.0
Name: female, dtype: float64

In [35]:
#VIA PIVOT TABLE CALCULATE HOW MANY MEN WERE IN A PARTICULAR CABIN CLASS. I ATTACHED A VARIABLE TO PVT_MALE.LOC
pvt_male = titantic_df.pivot_table(index=["Sex"], columns=["PClass"], values="Name", aggfunc='count')
male_cabin_count = pvt_male.loc["male", ["1st", "2nd", "3rd"]]
male_cabin_count

PClass
1st    179.0
2nd    172.0
3rd    499.0
Name: male, dtype: float64

In [36]:
#CREATED A DATAFRAME FROM THE RESULTS OF THE FEMALE AND MALE PIVOT TABLE
gender_cabin_count = pd.DataFrame({"Males in Cabin Class": male_cabin_count, "Females in Cabin Class": female_cabin_count})
gender_cabin_count

        Males in Cabin Class  Females in Cabin Class
PClass
1st                    179.0                   143.0
2nd                    172.0                   107.0
3rd                    499.0                   212.0